# Some Statistics with Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [ ]:
#check if notebook runs in colab
import sys
IN_COLAB = 'google.colab' in sys.modules
print('running in Colab:',IN_COLAB)
path='..'
if IN_COLAB:
  #in colab, we need to clone the data from the repo
  !git clone https://github.com/keuperj/DataScienceSS20.git
  path='DataScienceSS20'

In [4]:
import pandas as pd

### Step 2. 
User ***Jupyter Lab*** to view ``path+"/DATA/US_Baby_Names_right.csv"``.

### Step 3. Assign it to a variable called baby_names.

In [5]:
baby_names = pd.read_csv(path+'/DATA/US_Baby_Names_right.csv')

### Step 4. See the first 10 entries

In [6]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [7]:
baby_names.drop(['Unnamed: 0', 'Id'], axis = 1)

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

### Step 6. Are there more male or female names in the dataset?

In [8]:
baby_names.Gender.describe()

count     1016395
unique          2
top             F
freq       558846
Name: Gender, dtype: object

### Step 7. Group the dataset by name and assign to names

In [9]:
names = baby_names.groupby(baby_names.Name).sum()
names.head(10)

         Unnamed: 0         Id    Year  Count
Name
Aaban       7733801    7733803    4027     12
Aadan       7158061    7158065    8039     23
Aadarsh     1728030    1728031    2009      5
Aaden     555052029  555052225  393963   3426
Aadhav       709606     709607    2014      6
Aadhya    112003474  112003514   80515    453
Aadi       98044762   98044800   76340    307
Aadin       5061279    5061280    2008      5
Aadit       2090944    2090947    6029     18
Aaditya    25580966   25580980   28116     97

### Step 8. How many different names exist in the dataset?

In [10]:
baby_names.Name.nunique()

17632

### Step 9. What is the name with most occurrences?

In [11]:
baby_names['Name'][ baby_names['Count']== baby_names['Count'].max()]

#baby_names.groupby(baby_names.Name).sum()

107416    Daniel
Name: Name, dtype: object

### Step 10. How many different names have the least occurrences?

In [12]:
 baby_names['Name'][ baby_names['Count']== baby_names['Count'].min()].count()

147086

### Step 11. What is the median name occurrence?

In [13]:
baby_names.Count.mean()

34.85012421351935

### Step 12. What is the standard deviation of names?

In [14]:
# How can a standard deviation of names be given with names = Strings?
baby_names.Count.std()

97.39734648625934

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [18]:
baby_names.describe(include="all")

TypeError: data type "minimum" not understood